In [1]:
import pandas as pd
import boto3
import json

In [9]:
import configparser
config = configparser.ConfigParser()
config.read_file(open('dwh.cfg'))

KEY                    = config.get('AWS','KEY')
SECRET                 = config.get('AWS','SECRET')

DWH_ENDPOINT           = config.get("CLUSTER","HOST")
DWH_DB_NAME            = config.get("CLUSTER","DB_NAME")
DWH_DB_USER            = config.get("CLUSTER","DB_USER")
DWH_DB_PASSWORD        = config.get("CLUSTER","DB_PASSWORD")
DWH_PORT               = config.get("CLUSTER","DB_PORT")

DWH_IAM_ROLE_NAME      = config.get("IAM_ROLE","ARN")

#(DWH_DB_USER, DWH_DB_PASSWORD, DWH_DB)

pd.DataFrame({"Param":
                  ["DWH_ENDPOINT","DWH_DB_NAME","DWH_DB_USER","DWH_DB_PASSWORD","DWH_PORT","DWH_IAM_ROLE_NAME"],
              "Value":
                  [DWH_ENDPOINT, DWH_DB_NAME,DWH_DB_USER,DWH_DB_PASSWORD,DWH_PORT,DWH_IAM_ROLE_NAME]
             })

               Param                                              Value
0       DWH_ENDPOINT  dwhcluster.cekyhsjjwzop.us-west-2.redshift.ama...
1        DWH_DB_NAME                                         sparkifydb
2        DWH_DB_USER                                             dwhadm
3    DWH_DB_PASSWORD                                           Passw0rd
4           DWH_PORT                                               5439
5  DWH_IAM_ROLE_NAME          'arn:aws:iam::821310165567:role/DwhRole2'

In [10]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [11]:
conn_string="postgresql://{}:{}@{}:{}/{}".format(DWH_DB_USER, DWH_DB_PASSWORD, DWH_ENDPOINT, DWH_PORT,DWH_DB_NAME)
print(conn_string)
%sql $conn_string

postgresql://dwhadm:Passw0rd@dwhcluster.cekyhsjjwzop.us-west-2.redshift.amazonaws.com:5439/sparkifydb

'Connected: dwhadm@sparkifydb'

In [17]:
%sql SELECT * FROM songplays LIMIT 3;

 * postgresql://dwhadm:***@dwhcluster.cekyhsjjwzop.us-west-2.redshift.amazonaws.com:5439/sparkifydb
3 rows affected.

[(14, datetime.datetime(2018, 11, 21, 3, 12, 22), 80, 'paid', 'SOMULQH12A8C138213', 'ARENWML1187B99ECB6', 774, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (30, datetime.datetime(2018, 11, 26, 15, 37, 14), 88, 'paid', 'SOARTQC12A58A77F0C', 'ARCE0IX1187FB528B4', 900, 'Sacramento--Roseville--Arden-Arcade, CA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (46, datetime.datetime(2018, 11, 23, 15, 21, 17), 30, 'paid', 'SOQDMXT12A6D4F8255', 'ART5MUE1187B98C961', 691, 'San Jose-Sunnyvale-Santa Clara, CA', 'Mozilla/5.0 (Windows NT 6.1; WOW64; rv:31.0) Gecko/20100101 Firefox/31.0')]

In [16]:
%sql SELECT * FROM staging_events LIMIT 3;

 * postgresql://dwhadm:***@dwhcluster.cekyhsjjwzop.us-west-2.redshift.amazonaws.com:5439/sparkifydb
3 rows affected.

[(None, 'Logged Out', None, None, 0, None, None, 'free', None, 'PUT', 'Login', None, 52, None, 307, 1541207073796, None, None),
 (None, 'Logged In', 'Celeste', 'F', 1, 'Williams', None, 'free', 'Klamath Falls, OR', 'GET', 'Home', Decimal('1541077528796'), 52, None, 200, 1541207123796, '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.103 Safari/537.36"', 53),
 ('Mynt', 'Logged In', 'Celeste', 'F', 2, 'Williams', Decimal('166'), 'free', 'Klamath Falls, OR', 'PUT', 'NextSong', Decimal('1541077528796'), 52, 'Playa Haters', 200, 1541207150796, '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.103 Safari/537.36"', 53)]

In [15]:
%sql SELECT * from staging_songs limit 3

 * postgresql://dwhadm:***@dwhcluster.cekyhsjjwzop.us-west-2.redshift.amazonaws.com:5439/sparkifydb
3 rows affected.

[(1, 'ARZ5H0P1187B98A1DD', Decimal('33'), Decimal('-118'), 'Long Beach, CA', 'Snoop Dogg', 'SOAPERH12A58A787DC', 'The One And Only (Edited)', Decimal('230'), 0),
 (1, 'ARV6GHH1187B9AED0D', Decimal('62'), Decimal('17'), 'SWEDEN', 'Sofia Talvik', 'SOBXHCE12AB018B6AC', 'Arms and Armour', Decimal('249'), 2008),
 (1, 'AR35RMH1187FB4A865', Decimal('-22'), Decimal('-43'), 'Rio de Janeiro', 'Eumir Deodato', 'SOHZIGH12A6D4F8D14', 'A Grande Cacada', Decimal('111'), 0)]

In [18]:
%sql SELECT * from users limit 3;

 * postgresql://dwhadm:***@dwhcluster.cekyhsjjwzop.us-west-2.redshift.amazonaws.com:5439/sparkifydb
3 rows affected.

[(53, 'Celeste', 'Williams', 'F', 'free'),
 (95, 'Sara', 'Johnson', 'F', 'paid'),
 (66, 'Kevin', 'Arellano', 'M', 'free')]

In [19]:
%sql SELECT * from artists limit 3;

 * postgresql://dwhadm:***@dwhcluster.cekyhsjjwzop.us-west-2.redshift.amazonaws.com:5439/sparkifydb
3 rows affected.

[('AR5WJXR1187B9A0917', 'Orson', 'London, England', 51.0, 0.0),
 ('ARWDPT81187B99C656', 'The Kooks', 'Brighton, United Kingdom', 50.0, 0.0),
 ('ARIPXFO1187B9ACFF9', 'Erasure', 'London, England', 51.0, 0.0)]

In [20]:
%sql SELECT * from songs limit 3;

 * postgresql://dwhadm:***@dwhcluster.cekyhsjjwzop.us-west-2.redshift.amazonaws.com:5439/sparkifydb
3 rows affected.

[('SOEKAZG12AB018837E', "I'll Slap Your Face (Entertainment USA Theme)", 'ARSVTNL1187B992A91', 2001, 129.0),
 ('SOMZZON12A6701D3B9', 'My Lady (2003 Digital Remaster)', 'ARKUI581187B9A6856', 1997, 162.0),
 ('SOTEMHH12A8C1389A7', 'One Last Time', 'ARWDPT81187B99C656', 2008, 156.0)]

In [21]:
%sql SELECT * from time limit 3;

 * postgresql://dwhadm:***@dwhcluster.cekyhsjjwzop.us-west-2.redshift.amazonaws.com:5439/sparkifydb
3 rows affected.

[(datetime.datetime(2018, 11, 26, 15, 37, 14), 15, 26, 48, 11, 2018, 1),
 (datetime.datetime(2018, 11, 16, 8, 47, 22), 8, 16, 46, 11, 2018, 5),
 (datetime.datetime(2018, 11, 28, 18, 36, 57), 18, 28, 48, 11, 2018, 3)]